RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f472.s
                PUBWEAK DMA1_TC2_BTC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC2_BTC2_Handler
                B       DMA1_TC2_BTC2_Handler

                PUBWEAK DMA1_TC3_BTC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC3_BTC3_Handler
                B       DMA1_TC3_BTC3_Handler

                PUBWEAK DMA1_TC4_BTC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC4_BTC4_Handler
                B       DMA1_TC4_BTC4_Handler

                PUBWEAK DMA1_TC5_BTC5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC5_BTC5_Handler
                B       DMA1_TC5_BTC5_Handler

                PUBWEAK DMA1_TC6_BTC6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC6_BTC6_Handler
                B       DMA1_TC6_BTC6_Handler

                PUBWEAK DMA1_TC7_BTC7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA1_TC7_BTC7_Handler
                B       DMA1_TC7_BTC7_Handler

                PUBWEAK EFM_PEError_ReadCol_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_PEError_ReadCol_Handler
                B       EFM_PEError_ReadCol_Handler

                PUBWEAK EFM_OpEnd_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_OpEnd_Handler
                B       EFM_OpEnd_Handler

                PUBWEAK QSPI_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
QSPI_Handler
                B       QSPI_Handler

                PUBWEAK DCU1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU1_Handler
                B       DCU1_Handler

                PUBWEAK DCU2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU2_Handler
                B       DCU2_Handler

                PUBWEAK DCU3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DCU3_Handler
                B       DCU3_Handler

                PUBWEAK DMA2_Error_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_Error_Handler
                B       DMA2_Error_Handler

                PUBWEAK DMA2_TC0_BTC0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC0_BTC0_Handler
                B       DMA2_TC0_BTC0_Handler

                PUBWEAK DMA2_TC1_BTC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC1_BTC1_Handler
                B       DMA2_TC1_BTC1_Handler

                PUBWEAK DMA2_TC2_BTC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC2_BTC2_Handler
                B       DMA2_TC2_BTC2_Handler

                PUBWEAK DMA2_TC3_BTC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC3_BTC3_Handler
                B       DMA2_TC3_BTC3_Handler

                PUBWEAK DMA2_TC4_BTC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC4_BTC4_Handler
                B       DMA2_TC4_BTC4_Handler

                PUBWEAK DMA2_TC5_BTC5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC5_BTC5_Handler
                B       DMA2_TC5_BTC5_Handler

                PUBWEAK DMA2_TC6_BTC6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC6_BTC6_Handler
                B       DMA2_TC6_BTC6_Handler

                PUBWEAK DMA2_TC7_BTC7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA2_TC7_BTC7_Handler
                B       DMA2_TC7_BTC7_Handler

                PUBWEAK MAU_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MAU_Handler
                B       MAU_Handler

                PUBWEAK FMAC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FMAC1_Handler
                B       FMAC1_Handler

                PUBWEAK FMAC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FMAC2_Handler
                B       FMAC2_Handler

                PUBWEAK FMAC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FMAC3_Handler
                B       FMAC3_Handler

                PUBWEAK FMAC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FMAC4_Handler
                B       FMAC4_Handler

                PUBWEAK TMR0_1_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_1_Cmp_Handler
                B       TMR0_1_Cmp_Handler

                PUBWEAK TMR0_2_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_2_Cmp_Handler
                B       TMR0_2_Cmp_Handler

                PUBWEAK TMR2_1_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_1_Cmp_Handler
                B       TMR2_1_Cmp_Handler

                PUBWEAK TMR2_1_Ovf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_1_Ovf_Handler
                B       TMR2_1_Ovf_Handler

                PUBWEAK TMR2_2_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_2_Cmp_Handler
                B       TMR2_2_Cmp_Handler

                PUBWEAK TMR2_2_Ovf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_2_Ovf_Handler
                B       TMR2_2_Ovf_Handler

                PUBWEAK TMR2_3_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_3_Cmp_Handler
                B       TMR2_3_Cmp_Handler

                PUBWEAK TMR2_3_Ovf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_3_Ovf_Handler
                B       TMR2_3_Ovf_Handler

                PUBWEAK TMR2_4_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_4_Cmp_Handler
                B       TMR2_4_Cmp_Handler

                PUBWEAK TMR2_4_Ovf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR2_4_Ovf_Handler
                B       TMR2_4_Ovf_Handler

                PUBWEAK RTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Handler
                B       RTC_Handler

                PUBWEAK CLK_XtalStop_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CLK_XtalStop_Handler
                B       CLK_XtalStop_Handler

                PUBWEAK PWC_WKTM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_WKTM_Handler
                B       PWC_WKTM_Handler

                PUBWEAK SWDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SWDT_Handler
                B       SWDT_Handler

                PUBWEAK TMR6_1_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_GCmp_Handler
                B       TMR6_1_GCmp_Handler

                PUBWEAK TMR6_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Ovf_Udf_Handler
                B       TMR6_1_Ovf_Udf_Handler

