RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f472.s
                PUBWEAK TMR6_1_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Dte_Handler
                B       TMR6_1_Dte_Handler

                PUBWEAK TMR6_1_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_SCmp_Handler
                B       TMR6_1_SCmp_Handler

                PUBWEAK TMRA_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Ovf_Udf_Handler
                B       TMRA_1_Ovf_Udf_Handler

                PUBWEAK TMRA_1_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Cmp_Handler
                B       TMRA_1_Cmp_Handler

                PUBWEAK TMR6_2_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_GCmp_Handler
                B       TMR6_2_GCmp_Handler

                PUBWEAK TMR6_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Ovf_Udf_Handler
                B       TMR6_2_Ovf_Udf_Handler

                PUBWEAK TMR6_2_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Dte_Handler
                B       TMR6_2_Dte_Handler

                PUBWEAK TMR6_2_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_SCmp_Handler
                B       TMR6_2_SCmp_Handler

                PUBWEAK TMRA_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Ovf_Udf_Handler
                B       TMRA_2_Ovf_Udf_Handler

                PUBWEAK TMRA_2_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Cmp_Handler
                B       TMRA_2_Cmp_Handler

                PUBWEAK TMR6_3_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_GCmp_Handler
                B       TMR6_3_GCmp_Handler

                PUBWEAK TMR6_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_Ovf_Udf_Handler
                B       TMR6_3_Ovf_Udf_Handler

                PUBWEAK TMR6_3_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_Dte_Handler
                B       TMR6_3_Dte_Handler

                PUBWEAK TMR6_3_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_SCmp_Handler
                B       TMR6_3_SCmp_Handler

                PUBWEAK TMRA_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Ovf_Udf_Handler
                B       TMRA_3_Ovf_Udf_Handler

                PUBWEAK TMRA_3_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Cmp_Handler
                B       TMRA_3_Cmp_Handler

                PUBWEAK TMR6_4_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_GCmp_Handler
                B       TMR6_4_GCmp_Handler

                PUBWEAK TMR6_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_Ovf_Udf_Handler
                B       TMR6_4_Ovf_Udf_Handler

                PUBWEAK TMR6_4_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_Dte_Handler
                B       TMR6_4_Dte_Handler

                PUBWEAK TMR6_4_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_SCmp_Handler
                B       TMR6_4_SCmp_Handler

                PUBWEAK TMRA_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Ovf_Udf_Handler
                B       TMRA_4_Ovf_Udf_Handler

                PUBWEAK TMRA_4_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Cmp_Handler
                B       TMRA_4_Cmp_Handler

                PUBWEAK TMR6_5_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_GCmp_Handler
                B       TMR6_5_GCmp_Handler

                PUBWEAK TMR6_5_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_Ovf_Udf_Handler
                B       TMR6_5_Ovf_Udf_Handler

                PUBWEAK TMR6_5_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_Dte_Handler
                B       TMR6_5_Dte_Handler

                PUBWEAK TMR6_5_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_5_SCmp_Handler
                B       TMR6_5_SCmp_Handler

                PUBWEAK TMR6_6_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_GCmp_Handler
                B       TMR6_6_GCmp_Handler

                PUBWEAK TMR6_6_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_Ovf_Udf_Handler
                B       TMR6_6_Ovf_Udf_Handler

                PUBWEAK TMR6_6_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_Dte_Handler
                B       TMR6_6_Dte_Handler

                PUBWEAK TMR6_6_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_6_SCmp_Handler
                B       TMR6_6_SCmp_Handler

                PUBWEAK TMR6_7_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_7_GCmp_Handler
                B       TMR6_7_GCmp_Handler

                PUBWEAK TMR6_7_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_7_Ovf_Udf_Handler
                B       TMR6_7_Ovf_Udf_Handler

                PUBWEAK TMR6_7_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_7_Dte_Handler
                B       TMR6_7_Dte_Handler

                PUBWEAK TMR6_7_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_7_SCmp_Handler
                B       TMR6_7_SCmp_Handler

                PUBWEAK TMR6_8_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_8_GCmp_Handler
                B       TMR6_8_GCmp_Handler

                PUBWEAK TMR6_8_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_8_Ovf_Udf_Handler
                B       TMR6_8_Ovf_Udf_Handler

                PUBWEAK TMR6_8_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_8_Dte_Handler
                B       TMR6_8_Dte_Handler

