RT-Thread/rt-thread/bsp/hc32/libraries/hc32f472_ddl/cmsis/Device/HDSC/hc32f4xx/Source/IAR/startup_hc32f472.s
                PUBWEAK EMB_GR3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR3_Handler
                B       EMB_GR3_Handler

                PUBWEAK EMB_GR4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR4_Handler
                B       EMB_GR4_Handler

                PUBWEAK EMB_GR5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR5_Handler
                B       EMB_GR5_Handler

                PUBWEAK EMB_GR6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR6_Handler
                B       EMB_GR6_Handler

                PUBWEAK HASH_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HASH_Handler
                B       HASH_Handler

                PUBWEAK USART5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART5_Handler
                B       USART5_Handler

                PUBWEAK USART6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART6_Handler
                B       USART6_Handler

                PUBWEAK MDIO_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MDIO_Handler
                B       MDIO_Handler

                PUBWEAK PLA_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PLA_Handler
                B       PLA_Handler

                PUBWEAK I2C1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_Handler
                B       I2C1_Handler

                PUBWEAK I2C2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_Handler
                B       I2C2_Handler

                PUBWEAK I2C3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_Handler
                B       I2C3_Handler

                PUBWEAK USART1_WKUP_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_WKUP_Handler
                B       USART1_WKUP_Handler

                PUBWEAK PWC_LVD1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_LVD1_Handler
                B       PWC_LVD1_Handler

                PUBWEAK PWC_LVD2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_LVD2_Handler
                B       PWC_LVD2_Handler

                PUBWEAK OTS_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
OTS_Handler
                B       OTS_Handler

                PUBWEAK FCM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FCM_Handler
                B       FCM_Handler

                PUBWEAK WDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
WDT_Handler
                B       WDT_Handler

                PUBWEAK CTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CTC_Handler
                B       CTC_Handler

                PUBWEAK ADC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC1_Handler
                B       ADC1_Handler

                PUBWEAK ADC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC2_Handler
                B       ADC2_Handler

                PUBWEAK ADC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
ADC3_Handler
                B       ADC3_Handler

                PUBWEAK TRNG_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TRNG_Handler
                B       TRNG_Handler

                PUBWEAK USART1_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART1_TxComplete_Handler
                B       USART1_TxComplete_Handler

                PUBWEAK USART2_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART2_TxComplete_Handler
                B       USART2_TxComplete_Handler

                PUBWEAK USART3_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART3_TxComplete_Handler
                B       USART3_TxComplete_Handler

                PUBWEAK USART4_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART4_TxComplete_Handler
                B       USART4_TxComplete_Handler

                PUBWEAK USART5_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART5_TxComplete_Handler
                B       USART5_TxComplete_Handler

                PUBWEAK USART6_TxComplete_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
USART6_TxComplete_Handler
                B       USART6_TxComplete_Handler

                END
